package ru.ilapin.customloader;

import java.util.ArrayList;
import java.util.List;

/**
 * Created by Raynor on 10.02.2015.
 */
public class DataProvider {

	public static List<DataEntry> sDataEntries;

	static {
		final String[] rawData = new String[]{
				"Москва",
				"Санкт-Петербург",
				"Новосибирск",
				"Екатеринбург",
				"Нижний Новгород",
				"Казань",
				"Самара",
				"Челябинск",
				"Омск",
				"Ростов-на-Дону",
				"Уфа",
				"Красноярск",
				"Пермь",
				"Волгоград",
				"Воронеж",
				"Саратов",
				"Краснодар",
				"Тольятти",
				"Тюмень",
				"Ижевск",
				"Барнаул",
				"Ульяновск",
				"Иркутск",
				"Владивосток",
				"Ярославль",
				"Хабаровск",
				"Махачкала",
				"Оренбург",
				"Томск",
				"Новокузнецк",
				"Кемерово",
				"Астрахань",
				"Рязань",
				"Набережные Челны",
				"Пенза",
				"Липецк",
				"Тула",
				"Киров",
				"Чебоксары",
				"Калининград",
				"Курск",
				"Улан-Удэ",
				"Ставрополь",
				"Магнитогорск",
				"Брянск",
				"Иваново",
				"Тверь",
				"Сочи",
				"Белгород",
				"Нижний Тагил",
				"Нью-Йорк",
				"Джэксонвилл",
				"Лос-Анджелес",
				"Индианаполис",
				"Чикаго",
				"Остин",
				"Хьюстон",
				"Сан-Франциско",
				"Филадельфия",
				"Колумбус",
				"Финикс",
				"Форт-Уэрт",
				"Сан-Антонио",
				"Шарлотт",
				"Сан-Диего",
				"Детройт",
				"Даллас",
				"Эль-Пасо",
				"Сан-Хосе",
				"Мемфис"
		};
		sDataEntries = new ArrayList<>();
		for (int i = 0; i < rawData.length; i++) {
			final DataEntry entry = new DataEntry();
			entry.id = i;
			entry.label = rawData[i];

			sDataEntries.add(entry);
		}
	}
}
